# IsRamp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLegacyStairOrRamp..::..IsRamp Property
IFCLegacyStairOrRamp Class See Also
---
True if it is a ramp, false if it is a stair.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsRamp { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsRamp As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsRamp {
	bool get ();
}
```

# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace